{
  "name": "Masterprogram i telekommunikationssystem",
  "points": 120.0,
  "start": "2023 vecka 35",
  "end": "2025 vecka 23",
  "requirements": "Kandidatexamen eller högskoleingenjörsexamen omfattande 180 hp inom något av områdena elektroteknik, datavetenskap, programvaruteknik eller datorteknik. Examen ska omfatta minst 15 hp i matematik och minst 7,5 hp datorkommunikation därutöver krävs 30 hp från ett eller flera av områdena programmering, datastrukturer och algoritmer eller operativsystem där minst 7,5 hp ska vara programmering. Engelska 6.",
  "courses": [
    {
      "name": "Datorkommunikation",
      "points": 7.5,
      "start": "2023 vecka 35",
      "end": "2023 vecka 43",
      "requirements": "För tillträde till kursen krävs att 5 hp i C/C++ programmering är avklarat alternativt 15 hp avklarat i något annat programmeringsspråk.",
      "code": "DV1619",
      "description": "Grundläggande förståelse för datorkommunikation, med fokus på programmering av TCP/IP. Introduktion till lager och protokoll, Ethernet och IP stacken, med tillhörande protokoll (IP, UDP, TCP, DNS, HTTPs, mfl) , översikt av kommunikationsarkitekturer (klient-server, peer-2-peer), säkerhets- och implementationsaspekter i datorkommunikation.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BWTHQ",
      "optional": false
    },
    {
      "name": "Programmering i UNIX-miljö",
      "points": 7.5,
      "start": "2023 vecka 35",
      "end": "2023 vecka 43",
      "requirements": "För tillträde till kursen krävs att den studerande har avklarat kurser i programmering, 15 hp, algoritmer och datastrukturer, 6 hp, operativsystem, 6hp och datakommunikation alt lokala nätverk, 4 hp.",
      "code": "DV1457",
      "description": "Syftet med kursen är att studenten ska tillägna sig en fördjupad förståelse för UNIX-baserade system och för operativsystemnära programmering. Detta innebär bl a att kunna programmera på operativsystemets mest abstrakta nivå, närmast användaren, och nedåt genom abstraktionsnivåerna till den lägsta nivån, systemanropen.Kursen lär ut hur man designar mjukvara som interagerar med datorn via operativsystemet UNIX (och UNIX-baserade/liknande operativsystem såsom Linux och MacOS). Den lägger grunden för vidare studier inom andra områden (till exempel datasäkerhet) som kräver konkret förståelse för den underliggande teknologin. Syftet uppnås genom att studenten via en serie laborationer får praktisk erfarenhet av att utveckla program i en UNIX-miljö.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/B6YRM",
      "optional": true
    },
    {
      "name": "Introduktion till Cloud Computing",
      "points": 7.5,
      "start": "2023 vecka 44",
      "end": "2024 vecka 02",
      "requirements": "För tillträde till kursen krävs att den studerande har avklarat: programmering 15 hp, algoritmer och datastrukturer 6 hp  och  operativsystem 6 hp.",
      "code": "DV1566",
      "description": "Kursen fokuserar på de grundläggande koncepten för distribuerade system och cloud computing. Kursen omfattar teoretiska och praktiska aspekter med fokus på verkliga exempel. Efter genomförd  kurs ska studenten vara kapabel att välja, installera och använda grundläggande molnresurser (till exempel datorer och lagring som en tjänst) och att utforma och implementera skalbara arkitekturer och applikationer.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BN7DT",
      "optional": true
    },
    {
      "name": "Nätverks- och systemsäkerhet",
      "points": 7.5,
      "start": "2023 vecka 44",
      "end": "2024 vecka 02",
      "requirements": "Avklarad kurs i Datakommunikation 7,5 hp och Objektorienterad programmering 7,5 hp",
      "code": "ET2595",
      "description": "Syftet med kursen är att studenterna skall lära sig hur data, datorsystem och nätverk kan skyddas mot obehörig åtkomst.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BPEYX",
      "optional": false
    },
    {
      "name": "Avancerad nätverksteknik",
      "points": 7.5,
      "start": "2024 vecka 03",
      "end": "2024 vecka 12",
      "requirements": "För tillträde till kursen krävs minst 7,5 hp avklarade i datakommunikation och minst 7,5 hp avklarade i objektorienterad programmering, 7,5 hp.",
      "code": "DV2601",
      "description": "Kursen syftar till att ge fördjupade teoretiska och tillämpade kunskaper inom avancerade och komplexa nätverkstekniker. Detta omfattar förståelse av metoder, protokoll samt mekanismer så att studenten kan förklara och jämföra avancerade och grundläggande nätverkstekniker.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/B4GEL",
      "optional": true
    },
    {
      "name": "Forskningsmetodik i datavetenskap",
      "points": 7.5,
      "start": "2024 vecka 03",
      "end": "2024 vecka 12",
      "requirements": "För tillträde till kursen krävs 180 avklarade hp. Av dessa ska minst 165 hp ska vara inom något av områdena datavetenskap, informationssystem, datateknik, AI och maskininlärning, telekommunikationssystem och/eller datorsäkerhet. Minst 7,5 hp ska vara inom datavetenskap eller objektorienterad programmering. I de avklarade 180 hp ska även minst 15 hp matematik ingå.",
      "code": "DV2631",
      "description": "Syftet med kursen är att ge studenterna möjlighet att diskutera och praktisera ett vetenskapligt förhållningssätt, att få kunskap om aktuell forskning inom ett valt område och att öva på akademiskt skrivande. Sådana områden hänför sig till huvudområdena datavetenskap, informationssystem, datateknik, artificiell intelligens och maskininlärning, telekommunikationssystem och datorsäkerhet. En viktig forskningsfråga är att föreslå, utveckla, utvärdera och jämföra metoder, verktyg, språk, modeller/designer, algoritmer etc, och deras inverkan på olika system, organisationer och människor.Kursen ger studenterna en förståelse för den forskningsmetodik som gör det möjligt att behandla ovan nämnda forskningsfråga. Vidare kommer studenterna att introduceras till de samhälleliga och etiska aspekterna av den aktuella forskningen och få erfarenhet av att planera, genomföra och redovisa ett forskningsprojekt.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/B4H3Y",
      "optional": false
    },
    {
      "name": "Drift av nätverk och nätverkstjänster",
      "points": 7.5,
      "start": "2024 vecka 13",
      "end": "2024 vecka 22",
      "requirements": "För tillträde till kursen krävs minst 7,5 hp avklarade i datakommunikation och minst 7,5 hp avklarade i objektorienterad programmering, 7,5 hp.",
      "code": "DV2602",
      "description": "Kursen ger kunskaper i processer, metoder och tekniker för installation, drift och underhåll av kommunikationsnätverk och tillhörande tjänster. Kursen problematiserar de utmaningar som finns på grund av antalet nätverkskomponenter, tjänster och användare. Kursen ger även en översikt av nätverk och tjänstekonfiguration, samt övervakning av dessa.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/B7W6W",
      "optional": true
    },
    {
      "name": "Matematisk statistik",
      "points": 7.5,
      "start": "2024 vecka 13",
      "end": "2024 vecka 22",
      "requirements": "15 hp matematik avklarat.",
      "code": "MS1411",
      "description": "Kursens syfte är att studenterna skall skaffa sig kunskaper i såväl sannolikhetsteori som statistisk teori och metodik. Tonvikten ligger på sannolikhetsteori och stokastiska processer med tekniska tillämpningar.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BPKPK",
      "optional": true
    },
    {
      "name": "Kapacitetsanalys",
      "points": 7.5,
      "start": "2024 vecka 36",
      "end": "2024 vecka 44",
      "requirements": "För tillträde till kursen krävs avklarad kurs Matematik, fortsättningskurs, 7,5 hp samt genomgången kurs i Matematisk statistik 7,5 hp.",
      "code": "DV2604",
      "description": "Kursen syftar till att studenten ska förvärva kunskaper i köteori för att lösa dimensionerings och optimeringsproblem som uppstår i kommunikationssystem. Studenten skaffar sig förmågan att med matematiska verktyg bestämma mängden av resurser (länkar, samtals-kanaler, buffertar, processorkraft etc.). Dessa resurser krävs för att ett system ska uppnå en viss tjänstekvalitet till en minimal kostnad för operatören och därmed kunden.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BTHNU",
      "optional": true
    },
    {
      "name": "Tillämpad artificiell intelligens",
      "points": 7.5,
      "start": "2024 vecka 36",
      "end": "2024 vecka 44",
      "requirements": "För tillträde till kursen krävs 12 avklarade hp från moment i programmeringskurser (Python eller dylikt) samt 6 avklarade hp i datastrukturer och algoritmer.",
      "code": "DV2618",
      "description": "Artificiell intelligens (AI) i olika former finns i en allt större del av de datoriserade systemen vi använder, t.ex. i form av optimeringstekniker, beslutsstödsystem, bildbehandlingsanalys och robotar. Kursen syftar till att introducera området artificiell intelligens och några av dess tillämpningar.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BADLG",
      "optional": true
    },
    {
      "name": "Fördjupningskurs i Datavetenskap och kommunikation",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs att studenten har 90 högskolepoäng i programvaruteknik eller datavetenskap samt minst 30 högskolepoäng på masternivå inom dessa områden.",
      "code": "DV2545",
      "description": "Kursens syfte är att ge studenterna möjligheter till att fördjupa sina kunskaper och sin förståelse inom ett specifikt område inom datavetenskap eller programvaruteknik. Kursen utgör en direkt förberedelse för ett kommande magisterarbete.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BCD7J",
      "optional": true
    },
    {
      "name": "Maskininlärning",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs en avklarad kurs inom Tillämpad artificiell intelligens omfattande minst 6 hp.",
      "code": "DV2626",
      "description": "Det huvudsakliga syftet med kursen är att introducera teori och metod från maskininlärning (machine learning) samt praktiska tillämpningar inom informationsutvinning (data mining). Den teknologiska utvecklingen har bidragit till att vi blivit mer beroende av databaser för lagring och databehandling. Antalet databaser och mängden innehåll i dessa växer snabbt. I takt med denna tillväxt blir det svårare att manuellt finna användbar information från den stora mängden data. Vi behöver därför semiautomatiska och automatiska metoder för att använda, aggregera, analysera och extrahera sådan information. Metoder och tekniker från maskininlärning, informationsutvinning, och artificiell intelligens har visat sig användbara för detta syfte.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/B7UDJ",
      "optional": true
    },
    {
      "name": "Mjukvarubaserade nätverk",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs genomgången kurs Avancerad nätverksteknik 7,5 hp.",
      "code": "DV2603",
      "description": "Kursens syfte är att ge en övergripande förståelse av teknik, möjligheter och tillämpningar av mjukvarubaserade kommunikationsnätverk. Kursen behandlar den utveckling som pågår inom nätverk, switching, virtualisering, algoritmer, mjukvaruplattformar, programvaruteknik och säkerhetskoncept för mjukvarubaserade kommunikationsnät och molnbaserade tjänster, med fokus på Software Defined Networking (SDN) och Network Function Virtualization (NFV).",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BDAPU",
      "optional": true
    },
    {
      "name": "Upplevd kvalitet i nätverksbaserade tjänster",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "Avklarad kurs i Datakommunikation 7,5 hp och Matematisk statistik 7,5 hp.",
      "code": "ET2601",
      "description": "Området upplevd kvalitet i nätverksbaserade tjänster (Quality of Experience, QoE) får mycket uppmärksamhet hos tjänsteoperatörerna. Bättre tjänster ger fler nöjda kunder och kan därmed bidra till högre inkomster. Tjänsteoperatörer använder sig av mätningar av upplevd kvalitet och framhäver gärna positiva resultat i marknadsföringen, medan negativa resultat används i tjänsteutvecklingen. Mot denna bakgrund är syftet med kursen att ge studenterna insikter, praktiska färdigheter och tolkningsförmåga i hur en kvalitetsmätnings- och kvalitetsbedömningsprocess går till, vilka nätverksbeteenden och -parametrar som påverkar upplevelsen av olika typer av tjänster, hur man ta fram och tolkar QoE modeller, och på vilket sätt tjänsteleveransen kan förbättras under givna omständigheter och randvillkor.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BLQPF",
      "optional": true
    },
    {
      "name": "Masterarbete i datavetenskap",
      "points": 30.0,
      "start": "2025 vecka 04",
      "end": "2025 vecka 23",
      "requirements": "För tillträde till kursen krävs minst 90 högskolepoäng inom huvudområdet datavetenskap, varav minst 30 högskolepoäng på avancerad nivå. Dessutom krävs att den studerande har avklarat en kurs i forskningsmetodik i programvaruteknik och/eller datavetenskap om 7.5 högskolepoäng.",
      "code": "DV2572",
      "description": "Syftet med kursen är att studenten ska träna sin förmåga att definiera, planera, genomföra och redovisa ett självständigt vetenskapligt forskningsarbete. Studenten förväntas tillämpa de under utbildningen förvärvade kunskaperna för att självständigt fördjupa sig inom ett eller flera specifika delområden inom huvudområdet datavetenskap. Målet för studenten är att muntligen och skriftligen redovisa resultatet av forskningsarbetet samt att kritiskt granska och opponera på ett annat examensarbete. Redovisningen ska uppfylla de krav och kriterier som gäller för vetenskaplig text.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20251/BAKGG",
      "optional": false
    }
  ],
  "href": "https://www.bth.se/utbildning/program-och-kurser/dvatk/",
  "updated": 1666633349348
}