{
  "name": "Högskoleingenjör i teknisk spelgrafik",
  "points": 180.0,
  "start": "2023 vecka 34",
  "end": "2026 vecka 23",
  "requirements": "Grundläggande behörighet samt Matematik 3c och Fysik 2.",
  "courses": [
    {
      "name": "Matematik grundkurs med problemlösning",
      "points": 6.0,
      "start": "2023 vecka 34",
      "end": "2023 vecka 43",
      "requirements": "För tillträde till kursen krävs att den studerande har grundläggande behörighet samt avklarade kurser i Matematik 3c och Fysik 2.",
      "code": "MA1495",
      "description": "Kursens syfte är att ge en introduktion till matematikstudier samt ge lämpliga förkunskaper för vidare studier i matematik. Kursen har ett tydligt fokus på problemlösning och utveckling av konceptuella förmågor i matematik.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BJNCM",
      "optional": false
    },
    {
      "name": "Programmering och problemlösning med Python",
      "points": 6.0,
      "start": "2023 vecka 34",
      "end": "2023 vecka 43",
      "requirements": "Grundläggande behörighet",
      "code": "DV1574",
      "description": "Kursen lär ut strukturerad programmering och problemlösning med programsspråket Python.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BC6GY",
      "optional": false
    },
    {
      "name": "Spelutveckling för teknisk spelgrafik",
      "points": 6.0,
      "start": "2023 vecka 35",
      "end": "2024 vecka 02",
      "requirements": "Grundläggande behörighet",
      "code": "DV1669",
      "description": "Syftet med kursen är att teoretiskt förvärva grundläggande kunskap om spelutvecklingsprocesser, yrkesroller och hållbarhet inom spelutveckling. Syftet är även att teoretiskt och praktiskt förvärva kunskap för rollen som teknisk spelgrafiker samt tillämpa kunskaper i ett mindre utvecklingsprojekt. Syftet med kursen är att teoretiskt förvärva grundläggande kunskap om spelutvecklingsprocesser, yrkesroller och hållbarhet inom spelutveckling. Syftet är även att teoretiskt och praktiskt förvärva kunskap för rollen som teknisk spelgrafiker samt tillämpa kunskaper i ett mindre utvecklingsprojekt.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/B4Y6R",
      "optional": false
    },
    {
      "name": "Linjär algebra 1",
      "points": 6.0,
      "start": "2023 vecka 44",
      "end": "2024 vecka 02",
      "requirements": "Grundläggande behörighet samt Matematik 4 och Fysik 2.",
      "code": "MA1448",
      "description": "Kursen syftar till att deltagarna inhämtar de grundläggande kunskaper inom linjär algebra som fordras inom tekniska utbildningsprogram.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BNWA9",
      "optional": false
    },
    {
      "name": "Teknisk 3D-grafik",
      "points": 6.0,
      "start": "2023 vecka 44",
      "end": "2024 vecka 02",
      "requirements": "Grundläggande behörighet",
      "code": "DV1635",
      "description": "Kursen syftar till att introducera studenten för skapandet av 3D-grafik. Kursen ska ge studenten förståelse för 3D-modellers uppbyggnad samt de tekniska aspekter som behöver tas hänsyn till vid skapandet av 3D-modeller avsedda för olika ändamål. Kursen ger även förståelse för relevanta filformat inom både 3D och 2D, material samt grundläggande förmåga inom texturering och UV-mappning.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BCCD9",
      "optional": false
    },
    {
      "name": "Analys 1",
      "points": 6.0,
      "start": "2024 vecka 03",
      "end": "2024 vecka 12",
      "requirements": "Grundläggande behörighet samt Matematik 4 och Fysik 2.",
      "code": "MA1444",
      "description": "Kursen syftar till att studenten skall skaffa sig grundläggande förståelse för matematisk analys i en variabel med tillämpningar inom framför allt tekniska ämnesområden.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/B6T3R",
      "optional": false
    },
    {
      "name": "Prototyputveckling för teknisk spelgrafik",
      "points": 12.0,
      "start": "2024 vecka 03",
      "end": "2024 vecka 22",
      "requirements": "För tillträde till kursen krävs genomgångna kurser i Grunder i spelutveckling 6 hp och Teknisk 3D-grafik, 6 hp samt 4 hp avklarade från kurser i programmering eller skripting.",
      "code": "DV1637",
      "description": "Kursens syfte är att ge grundläggande kunskap, färdighet och värderingsförmåga avseende spelteknisk prototyputveckling. Studenten förväntas efter kursens slut ha både teoretisk och praktisk kunskap om en grundläggande utvecklingsprocess, från idé till en färdig prototyp i en industristandardiserad spelmotor.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BND9H",
      "optional": false
    },
    {
      "name": "Spelgrafik",
      "points": 6.0,
      "start": "2024 vecka 03",
      "end": "2024 vecka 12",
      "requirements": "För tillträde till kursen krävs genomgångna kurser Grunder i spelutveckling, 6 hp och Teknisk 3D-grafik, 6 hp.",
      "code": "DV1636",
      "description": "Kursen syftar till att ge grundläggande kunskaper och erfarenheter, både teoretiska och praktiska, i skapandet av spelgrafik. Detta sker med hjälp av 2D och 3D verktyg. Studenten förväntas efter kursens slut kunna given teori rörande spelgrafik och kunna skapa grundläggande spelgrafik för en industristandardiserad spelmotor.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BRWNG",
      "optional": false
    },
    {
      "name": "Skripting för spelgrafik",
      "points": 6.0,
      "start": "2024 vecka 13",
      "end": "2024 vecka 22",
      "requirements": "För tillträde i kursen krävs genomgångna kurser i Teknisk 3D-grafik, 6hp, Programmering och problemlösning med Python, 6 hp och Spelgrafik, 6hp.",
      "code": "DV1639",
      "description": "Skapandet och utvecklandet av spelgrafik innefattar repetitiva processer som med hjälp av små program, så kallade skript, kan underlättas. Syftet med kursen är att introducera studenten till hur man med hjälp av skript kan underlätta och optimera skapandet av spelgrafik.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BJ4UJ",
      "optional": false
    },
    {
      "name": "Matematisk statistik med programvara",
      "points": 6.0,
      "start": "2024 vecka 36",
      "end": "2024 vecka 44",
      "requirements": "Avklarad kurs Matematik grundkurs för högskoleingenjörer, 6 hp. Genomgångna kurser Analys 1, 6 hp samt Linjär Algebra, 6 hp.",
      "code": "MS1413",
      "description": "Kursens syfte är att studenterna skall skaffa sig kunskaper i såväl sannolikhetsteori som statistisk teori och metodik. En väsentlig del av kursen består i att lära sig hantera statistik med stöd av programvara.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BFPDG",
      "optional": false
    },
    {
      "name": "Tillämpad spelgrafik",
      "points": 14.0,
      "start": "2024 vecka 36",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs avklarad kurs i Teknisk 3D-grafik, 6 hp och 6 hp avklarade inom matematik samt genomgången kurs i Linjär Algebra 1, 6 hp.",
      "code": "DV1640",
      "description": "Kursen syftar till att studenten ska lära sig att utifrån referensmaterial skapa spelgrafik och få en god förståelse för hur olika tekniker kan nyttjas inom skapandet av spelgrafik. Studenten förväntas efter avslutad kurs ha både teoretisk och praktisk kunskap kring skapandet av spelgrafik för en industristandardiserad spelmotor.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BA4U7",
      "optional": false
    },
    {
      "name": "3D-programmering 1",
      "points": 6.0,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs avklarad kurs i Linjär algebra 1, 6 hp samt 10 hp avklarade i programmering och/eller skripting.",
      "code": "DV1644",
      "description": "3D-programmering är en av huvudbyggstenarna inom spelproduktion och utgör en brygga mellan 3D-modellering och spelberättelse. Syftet med kursen är att studenterna ska skaffa sig en introducerande och grundläggande förståelse för 3D-grafik och 3D-programmering samt kunskap om de viktigaste begreppen i ämnet. I kursen så ligger fokus på att få en grundläggande förståelse för strålspårning (eng: ray tracing) samt rastrerad rendering (eng: rasterizerad rendering). Studenterna kommer få arbeta med dels matematiken som ligger bakom strålspårning samt renderingspipelinen och shaderfiler för rastrerad rendering med hjälp av ett renderings-API.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BYM4R",
      "optional": false
    },
    {
      "name": "Ledarskap och projektverksamhet",
      "points": 4.0,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "Grundläggande behörighet.",
      "code": "IY1424",
      "description": "Kursen syftar till att studenten ska förvärva grundläggande kunskap, förståelse, färdighet, förmåga och förhållningssätt inom ledarskap och projektverksamhet.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BJTFN",
      "optional": false
    },
    {
      "name": "Fysik för teknisk spelgrafik",
      "points": 6.0,
      "start": "2025 vecka 04",
      "end": "2025 vecka 13",
      "requirements": "För tillträde till kursen krävs avklarad kurs i Linjär algebra, 6 hp samt genomgången kurs i Analys 1, 6 hp.",
      "code": "FY1434",
      "description": "Kursens syfte är att ge studenten grundläggande kunskap om de fysikaliska lagar som styr kroppars egenskaper och rörelser samt färdighet i att tillämpa metoder för hur dessa egenskaper och rörelser kan modelleras och simuleras i realtid.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20251/BNCLJ",
      "optional": false
    },
    {
      "name": "Litet spelprojekt för teknisk spelgrafik",
      "points": 10.0,
      "start": "2025 vecka 04",
      "end": "2025 vecka 13",
      "requirements": "För tillträde till kursen krävs 36 hp avklarat inom området spelutveckling, samt genomgången kurs 3D-programmering 1, 6 hp.",
      "code": "DV1646",
      "description": "Som spelutvecklare krävs god samarbetsförmåga samt en förståelse för vad god kvalitet innebär. Kursen syftar till att, i mindre grupp, designa, implementera och dokumentera ett småskaligt speltekniskt projekt. Projekten kommer att drivas utifrån en agil mjukvaruutveckling, som är ett samlingsnamn för interativa och inkrementella metoder där krav successivt utvecklas under processens gång. Syftet är att förmedla och ge erfarenheter hur man planerar, utför och slutför ett projekt.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20251/BNTRY",
      "optional": false
    },
    {
      "name": "Animationstekniker",
      "points": 8.0,
      "start": "2025 vecka 14",
      "end": "2025 vecka 23",
      "requirements": "För tillträde till kursen krävs avklarade kurser i Teknisk 3D-grafik, 6 hp och Spelgrafik, 6 hp samt genomgången kurs Digital skulptering och optimering, 6 hp.",
      "code": "DV1648",
      "description": "Kursen syftar till att ge kunskaper och erfarenheter, både teoretiska och praktiska, inom området animering för spel. Kursen avser att ge grundläggande kunskaper inom riggning, skinning och animation av spelmodeller, både organiska och mekaniska samt implementation och applicering av animationsdata i industristandardiserad spelmotor.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20251/B9M6K",
      "optional": false
    },
    {
      "name": "Specialeffekter i spel",
      "points": 6.0,
      "start": "2025 vecka 14",
      "end": "2025 vecka 23",
      "requirements": "För tillträde till kursen krävs avklarad kurs i Teknisk 3D-grafik, 6 hp samt 6 hp avklarade inom matematik och 6 hp avklarade inom fysik.",
      "code": "DV1650",
      "description": "Kursen syftar till att ge teoretiska och praktiska kunskaper och erfarenheter, inom området specialeffekter i spel. Detta innebär att skapa, implementera och driva modeller, animationer och effekter med hjälp av dynamik, fysik och partikelsystem. Kursen avser även att ge grundläggande förståelse för de estetiska aspekterna i förhållande till prestandakostnad.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20251/BXJKH",
      "optional": false
    },
    {
      "name": "Forskningsmetodik för spelteknik",
      "points": 6.0,
      "start": "2025 vecka 36",
      "end": "2025 vecka 44",
      "requirements": "För tillträde till kursen krävs att studenten har avklarat kurser motsvarande 60 hp inom Datavetenskap, Matematik och/eller Fysik.",
      "code": "DV1666",
      "description": "Kursen skall ge studenten en introduktion till forskningsmetodik genom framtagning, utvärdering och jämförelse av metoder, tekniker och verktyg och hur dessa påverkar olika system eller organisationer. I denna kurs får studenten en förståelse för forskningsmetodik som gör en sådan utvärdering och jämförelse möjligt. Studenten får också erfarenheter av aktuell forskning inom området genom att planera, genomföra och rapportera ett mindre forskningsprojekt inom spelteknikområdet.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20252/BFNY7",
      "optional": false
    },
    {
      "name": "Stort spelprojekt för teknisk spelgrafik",
      "points": 24.0,
      "start": "2025 vecka 36",
      "end": "2026 vecka 03",
      "requirements": "För tillträde till kursen krävs  avklarade kurser i Litet spelprojekt för Teknisk spelgrafik, 10 hp, 3D-programmering 1, 6 hp,  Tillämpad spelgrafik, 14 hp, samt genomgått kurserna pluginkonstruktion, 6 hp och animationstekniker, 8 hp.",
      "code": "DV1653",
      "description": "Syftet med kursen är att förbereda för yrkesverksamhet inom spelindustrin. Att utveckla en omfattande spelprogramvara ställer stora krav på tekniskt kunnande. Utvecklaren måste vara skicklig i att problemlösa samt kunna designa och dokumentera arkitekturen för större programvaror. Metoder och utvecklingsprocesser inom kursen är inriktade på iterativa, agila och informella arbetssätt som är vanligt i spelindustrin. Kursen är upplagd för att efterlikna ett projekt som det kan bedrivas ute i industrin.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20252/BXXRX",
      "optional": false
    },
    {
      "name": "Examensarbete i datavetenskap för högskoleingenjörer",
      "points": 18.0,
      "start": "2026 vecka 04",
      "end": "2026 vecka 23",
      "requirements": "För tillträde till kursen krävs att studenten har avklarat 60 hp, varav minst 30 hp inom datavetenskap. De övriga 30 hp kan, förutom datavetenskap, även vara inom matematik,  programvaruteknik, och elektroteknik. Dessutom måste studenten ha genomgått en kurs i forskningsmetodik om minst 6 hp.",
      "code": "DV1583",
      "description": "Examensarbetskurs för högskoleingenjör och teknologie kandidat i samband med högskoleingenjörsexamen. Syftet med examensarbetet är att studenten integrerar, fördjupar och vidareutvecklar sina kunskaper och färdigheter inom ett begränsat område av det som behandlats inom tidigare genomförda kurser inom programmet. Detta inkluderar att självständigt identifiera ett problem och formulera relevanta forskningsfrågor i datavetenskap. Syftet är vidare att planera, utveckla, genomföra och presentera ett vetenskapligt och ingenjörsmässigt arbete på teknologie kandidatnivå inom området datavetenskap. Arbetet kan vara av utredande eller konstruktiv karaktär och ska innefatta litteraturstudier, utvecklingsarbete och rapportskrivning. Målet för studenten är att muntligen och skriftligen redovisa resultatet av arbetet samt kritiskt granska och opponera på ett annat examensarbete. Redovisningen ska uppfylla de krav och kriterier som gäller för vetenskaplig text.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20261/BR4RH",
      "optional": false
    },
    {
      "name": "Industriell ekonomi, översiktskurs",
      "points": 6.0,
      "start": "2026 vecka 04",
      "end": "2026 vecka 13",
      "requirements": "Områdesbehörighet 3: Matematik C, Samhällskunskap A.  (Naturkunskap B krävs ej.)",
      "code": "IY1402",
      "description": "Kursens syfte är att de studerande ska få en introduktion till industriell ekonomi samt en översiktlig bild över hur dess delområden hänger samman.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20261/BWPNG",
      "optional": false
    },
    {
      "name": "Plugin-konstruktion",
      "points": 6.0,
      "start": "2026 vecka 04",
      "end": "2026 vecka 13",
      "requirements": "För tillträde till kursen krävs avklarade kurser i Teknisk 3D-grafik, 6 hp, Programmering och problemlösning med Python 6 hp och Skripting för spelgrafik, 6 hp.",
      "code": "DV1649",
      "description": "Spelutveckling innebär skapande av många objekt och parallella arbetsflöden där speldata skickas mellan flera utvecklarroller. För att hantera och automatisera delar av denna process kan insticksprogram, så kallade plugins, nyttjas. Syftet med kursen är att introducera studenten till hur ett insticksprogram kan designas, implementeras och nyttjas i en grafikprogramvara.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20261/BJFWK",
      "optional": false
    }
  ],
  "href": "https://www.bth.se/utbildning/program-och-kurser/dvghg/",
  "updated": 1666647545333
}