{
  "name": "Civilingenjör i marin teknik",
  "city": "Karlskrona",
  "study_plan": "https://edu.bth.se/utbildningsplaner/MTAMR_ht-22.pdf",
  "form": "Campus",
  "speed": 100,
  "location": "Campus",
  "code": "MTAMR22h",
  "points": 300.0,
  "languages": [
    "Svenska",
    "Engelska"
  ],
  "teacher": "joo",
  "url": "https://www.bth.se/utbildning/program/mtamr20h/",
  "required_courses": [
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    {
      "name": "Nautisk introduktion",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=MT1557&revision=1&lang=sv",
      "form": "Campus",
      "speed": 25,
      "location": "Campus",
      "code": "MT1557",
      "points": 6.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Kursen ger studenten en grundläggande förståelse för hur marin verksamhet bedrivs ur ett praktiskt och teoretiskt perspektiv. Kunskaper och färdigheter som erhålls i kursen används senare i programmet i de mer avancerade kurserna, och ger en grund för den marintekniska miljö den färdiga ingenjören möter.",
      "requirements": "Grundläggande behörighet samt Matematik 4, Fysik 2, och Kemi 1 eller Matematik E, Fysik B och Kemi A.",
      "start": "2023 vecka 13",
      "end": "2023 vecka 22"
    },
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    null,
    {
      "name": "Signaler och system, grundkurs",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=ET1555&revision=1&lang=sv",
      "form": "Campus",
      "speed": 25,
      "location": "Campus",
      "code": "ET1555",
      "points": 9.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Kursen syftar till att studenten ska erhålla de teoretiska grunderna inom modern digital signalbehandling, för såväl deterministiska som stokastiska signaler, samt att ge kunskap och insikt om tillämpade signalbehandlingsproblem. Den studerande skall vara väl förberedd för såväl signalbehandling inom industrin som för fortsatta studier inom området.",
      "requirements": "För tillträde till kursen krävs avklarad kurs i Transformteori, 6 hp samt genomgången kurs i Reglerteknik, 6 hp.",
      "start": "2025 vecka 04",
      "end": "2025 vecka 23"
    },
    null,
    null,
    null,
    null,
    null,
    {
      "name": "Sensorsystem",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=ET2613&revision=1&lang=sv",
      "form": "Campus",
      "speed": 50,
      "location": "Campus",
      "code": "ET2613",
      "points": 7.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Syftet med kursen är att studenten ska förvärva kunskap om egenskaperna hos och användningen av ett autonomt sensorsystem bestående av sensorer, aktuatorer, kommunikationsmoduler och bearbetningsalgoritmer som utgör IoT, Internet of Things. Studenten ska kunna designa och implementera smarta inbyggda system för mätning, kontroll, kommunikation och mönsterigenkänning.",
      "requirements": "För tillträde till kursen krävs avklarad kurs i Elektroteknik med tillämpningar inom mätteknik, 6 hp samt genomgångna kurser i Elektromagnetisk fältteori, 6 hp, Reglerteknik, grundkurs, 6 hp och Signaler och system, fortsättningskurs, 4 hp.",
      "start": "2025 vecka 45",
      "end": "2026 vecka 03"
    },
    {
      "name": "Elkraft och energiteknik",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=ET2615&revision=1&lang=sv",
      "form": "Campus",
      "speed": 50,
      "location": "Campus",
      "code": "ET2615",
      "points": 6.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Kursen syftar till att studenterna ska förvärva grundläggande kunskaper om elkraftsystems uppbyggnad och dess ingående elektriska maskiner från generering via transmission till förbrukning samt färdigheter i att utföra grundläggande beräkningar på sådana komponenter. Sådana kunskaper och färdigheter är nödvändiga grunder för vidare högskolestudier inom elkraftteknik och för professionellt arbete som ingenjör i energiomvandlingsprojekt som våg-, vind och solkraft.",
      "requirements": "För tillträde till kursen krävs avklarad kurs i Ellära, 6 hp och genomgångna kurser i Elektromagnetisk fältteori, 6 hp, Dynamik, 6 hp, Elektronik med tillämpningar inom mätteknik, 6 hp och Reglerteknik 6 hp.",
      "start": "2026 vecka 04",
      "end": "2026 vecka 13"
    },
    {
      "name": "Projektkurs 2 med industriell ekonomi och affärsplanering",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=MT2552&revision=1&lang=sv",
      "form": "Campus",
      "speed": 50,
      "location": "Campus",
      "code": "MT2552",
      "points": 15.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "I kursen tränar sig studenten på att tillämpa sina kunskaper och färdigheter i verklighetstrogna industri- eller innovationsprojekt. För att förbereda studenten för skarpa industriprojekt vävs moment om ekonomi och affärsplanering in som en integral del av kursen.",
      "requirements": "För tillträde till kursen krävs avklarad Projektkurs 1 med produktutveckling och projektledning, 15 hp.",
      "start": "2026 vecka 04",
      "end": "2026 vecka 23"
    },
    {
      "name": "Undervattensteknik",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=MT2551&revision=1&lang=sv",
      "form": "Campus",
      "speed": 50,
      "location": "Campus",
      "code": "MT2551",
      "points": 5.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Kursens syfte är att ge grundläggande förståelse och förmåga till utveckling och användning av undervattensfarkoster. I kursen deltar studenten i konstruktionen av en undervattensfarkost. Studenten skall definiera problemställningar, lösa energi- och kraftbehov samt utveckla reglersystem för att planera, utföra och utvärdera undervattensoperationer.",
      "requirements": "För tillträde till kursen krävs att följande kurser är genomgångna: Matlab med tillämpningar inom matematik och teknik, 4 hp, Strömningslära, 8 hp, Reglerteknik grundkurs, 6 hp och Marin konstruktion, 8 hp.",
      "start": "2026 vecka 04",
      "end": "2026 vecka 13"
    },
    {
      "name": "Fartygstillsyn och marina regelverk",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=MT1558&revision=1&lang=sv",
      "form": "Campus",
      "speed": 25,
      "location": "Campus",
      "code": "MT1558",
      "points": 4.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Kursens syfte är att ge en förståelse om hur fartygsutveckling, fartygskonstruktion, drift, ombyggnationer och uppgraderingar styrs av nationella regler och internationella koder, regelverk och överenskommelser.",
      "requirements": "För tillträde till kursen krävs avklarade kurser i Marin konstruktion, 8 hp och Nautisk introduktion, 6 hp.",
      "start": "2026 vecka 14",
      "end": "2026 vecka 23"
    },
    {
      "name": "Systems Engineering",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=MT2574&revision=1&lang=sv",
      "form": "Campus",
      "speed": 50,
      "location": "Campus",
      "code": "MT2574",
      "points": 7.5,
      "languages": [
        "Engelska"
      ],
      "teachers": [],
      "description": "Systems Engineering som disciplin har sitt ursprung i behovet av att utveckla alltmer komplexa system inom rymdindustrin. Tillämpningen av metoder och verktyg för Systems Engineering har i stor utsträckning påverkat utvecklingen av t.ex. flygplan och satelliter. De ökande socioekonomiska utmaningarna i samband med globalisering, befolkningstillväxt, ekonomisk globalisering och hållbarhet, betonar behovet av att Systems Engineering kompetenser tillämpas i olika domäner. Systems Engineering projekt kräver tvärvetenskapliga färdigheter och tvärfunktionella designteam, inklusive en bred uppsättning av discipliner, såsom design, tillverkning, systemanalys, kunskapshantering och hållbarhetsanalys. Kursdeltagarna har möjlighet att förvärva metodologiska och teoretiska kunskaper inom Systems Engineering och att tillämpa dem i ''real-life'' Systems Engineering projekt i samarbete med utvalda partnerföretag.",
      "requirements": "För tillträde till kursen krävs minst 180 avklarade hp, varav 90 hp inom maskinteknik, industriell ekonomi eller närliggande tekniskt område inklusive 5 hp datorstöd för ingenjörsarbete.",
      "start": "2026 vecka 36",
      "end": "2026 vecka 44"
    },
    {
      "name": "Säkerhet, ergonomi och människa-system-interaktion",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=MT1522&revision=1&lang=sv",
      "form": "Campus",
      "speed": 50,
      "location": "Campus",
      "code": "MT1522",
      "points": 7.5,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Kursen ger studenten kunskaper för att kunna förstå vilka krav som ställs på människa och system i en marin miljö, där viktiga delar i detta är säkerhet och säkerhetskultur, arbetsmiljö och ergonomi samt hur människan interagerar med omgivningen och om design av interaktionssystem. Vidare introducerar kursen till området människa-datorinteraktion (HCI).",
      "requirements": "För tillträde till kursen krävs avklarad kurs i Fartygstillsyn och marina regelverk, 4 hp.",
      "start": "2026 vecka 36",
      "end": "2026 vecka 44"
    },
    {
      "name": "Forskningsmetodik med inriktning mot ingenjörsvetenskap",
      "city": "Karlskrona",
      "study_plan": "https://edu.bth.seutb_kursplan.asp?kurskod=MT2521&revisionsnr=13&format=pdf",
      "form": "Campus",
      "speed": 50,
      "location": "Campus",
      "code": "MT2521",
      "points": 7.5,
      "languages": [
        "Engelska"
      ],
      "teachers": [],
      "description": "Studenten ska skaffa sig en grundläggande introduktion till moderna synsätt om vetenskap, särskilt naturvetenskap och ingenjörsvetenskap. Studenten ska förvärva en inblick i vetenskapens historia och filosofi samt hur vetenskapliga metoder tillämpas inom ingenjörsvetenskap, speciellt i elektro - och maskinteknik. Den studerande skall efter detta tillförskaffat sig kunskaper i hur man bedriver forskningsprojekt samt hur man skriver vetenskapliga texter.",
      "requirements": "Avklarade studier om minst 180 hp inom området teknik.",
      "start": "2026 vecka 45",
      "end": "2027 vecka 02"
    },
    {
      "name": "Kravhantering och produkthantering",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=PA2591&revision=1&lang=sv",
      "form": "Campus",
      "speed": 50,
      "location": "Campus",
      "code": "PA2591",
      "points": 7.5,
      "languages": [
        "Engelska"
      ],
      "teachers": [],
      "description": "Kursens syfte är att ge grundläggande och fördjupande kunskaper och färdigheter inom kontinuerlig kravhantering och produkthantering i storskalig utveckling av mjukvaruintensiva system och produkter i en förändringsbenägen och kostnadskänslig verklighet. Kursen ger både teoretisk analysförmåga inom ämnet och praktisk tillämpning av metoder och tekniker för kravhantering och produkthantering.",
      "requirements": "För tillträde till kursen krävs avklarade kurser omfattande minst 120 hp varav minst 90 hp ska vara inom följande områden: programvaruteknik, datavetenskap, informationssystem, datalogi, maskinteknik eller industriell ekonomi. Dessutom krävs en genomgången kurs på minst 7,5 hp inom grundläggande Programvaruteknik eller Systemteknik alternativt en genomgången projektkurs i grupp på minst 7,5 hp i Programvaruteknik eller Systemteknik.",
      "start": "2026 vecka 45",
      "end": "2027 vecka 02"
    },
    {
      "name": "Examensarbete för civilingenjörer",
      "city": "Karlskrona",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=TE2502&revision=4,1&lang=sv",
      "form": "Campus",
      "speed": 100,
      "location": "Campus",
      "code": "TE2502",
      "points": 30.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Syftet med kursen är att studenten tränar sin förmåga att definiera, planera, genomföra och redovisa ett självständigt forsknings- och utvecklingsarbete inom huvudämnet för civilingenjörsprogrammet. Examensarbetet innebär en tillämpning och syntes av de under utbildningen förvärvade kunskaper och ska visa studentens förmåga att arbeta självständigt som civilingenjör.",
      "requirements": "För tillträde till kursen krävs att studenten har avklarat minst 240 hp som får ingå i en civilingenjörsexamen. Av dessa ska minst 30 hp vara avklarade kurser på avancerad nivå.",
      "start": "2027 vecka 03",
      "end": "2027 vecka 22"
    }
  ],
  "optional_courses": [],
  "start": "2022 vecka 34",
  "end": "2023 vecka 02",
  "generated": "2023-01-08 21:57:04.270023"
}