{
  "name": "Specialistsjuksköterskeprogram med inriktning mot vård av äldre",
  "city": "DistansHela eller delar av undervisningen bedrivs på distans.",
  "study_plan": "https://edu.bth.se/utbildningsplaner/OMASD_ht-22.pdf",
  "form": "Distans",
  "speed": 50,
  "location": "Distans",
  "code": "OMASD22h",
  "points": 75.0,
  "languages": [
    "Svenska",
    "Engelska"
  ],
  "teacher": "Christel Borg",
  "url": "https://www.bth.se/utbildning/program/omasd20h/",
  "required_courses": [
    {
      "name": "Specialistsjuksköterskans profession och vetenskapliga förhållningssätt inom vård av äldre",
      "city": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=OM2532&revision=3,2&lang=sv",
      "form": "Distans",
      "speed": 50,
      "location": "Distans",
      "code": "OM2532",
      "points": 30.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [
        "Ulrika Bernow Johansson",
        "Christel Borg"
      ],
      "description": "Syftet med kursen är att studenten skall fördjupa sin förståelse för och förmåga till att kritiskt analysera omvårdnadsvetenskapens centrala begrepp ur ett teoretiskt och empiriskt perspektiv samt vidareutveckla förmågan att analysera och diskutera relationen specialistsjuksköterskans profession i förhållande till omvårdnadens kärnkompetenser med särskilt fokus på att kunna leda och utveckla omvårdnaden i en lärande och föränderlig miljö. Syftet är slutligen att producera en projektplan inför examensarbetet.",
      "requirements": "Sjuksköterskeexamen och kandidatexamen i omvårdnad/vårdvetenskap.",
      "start": "2022 vecka 35",
      "end": "2023 vecka 02"
    },
    {
      "name": "Farmakologi och förskrivningsrätt för vissa läkemedel, hjälpmedel och förbrukningsartiklar med inriktning mot vård av äldre",
      "city": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=OM2533&revision=3,2&lang=sv",
      "form": "Distans",
      "speed": 100,
      "location": "Distans",
      "code": "OM2533",
      "points": 15.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [
        "Ann-Kristin Olsson",
        "Christel Borg"
      ],
      "description": "Syftet med kursen är att studenterna ska fördjupa sina kunskaper utifrån ett vetenskapligt, reflektivt och kritiskt förhållningssätt inom farmakologi, diabetes-, stomi-, sår-, inkontinensvård, samt smärta och smärtbehandling. Syftet är vidare att med stöd av styrdokument kunna förskriva läkemedel, tekniska hjälpmedel och förbrukningsartiklar.",
      "requirements": "Sjuksköterskeexamen och kandidatexamen i omvårdnad/vårdvetenskap.",
      "start": "2023 vecka 03",
      "end": "2023 vecka 12"
    },
    {
      "name": "Specifik omvårdnad för vård av äldre",
      "city": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=OM2534&revision=4,3&lang=sv",
      "form": "Distans",
      "speed": 50,
      "location": "Distans",
      "code": "OM2534",
      "points": 15.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Syftet med kursen är att studenten ska fördjupa sina kunskaper om specifik omvårdnad och medicinska omvårdnadsåtgärder för vård av äldre utifrån omvårdnadsprocessen och kärnkompetenser och visa förmåga att utföra kvalificerad omvårdnad utifrån komplexa situationer inklusive vård vid livets slut. Vidare ska studenten fördjupa sina kunskaper om äldres fysiska och psykiska hälsa och ohälsa för att självständigt observera, bedöma, planera, genomföra och utvärdera komplexa situationer inom vård av äldre inom kontexten geriatrik, hemsjukvård, samt vård i livets slutskede. Syftet är slutligen att främja fysisk, psykisk och social hälsa och genom att kunna genomföra hälsoundersökningar, förebygga uppkomsten av sjukdom sjukdomskomplikationer, samt fortsatt habilitering vid redan uppkomna funktionsnedsättningar.",
      "requirements": "Sjuksköterskeexamen och kandidatexamen i omvårdnad/vårdvetenskap.",
      "start": "2023 vecka 35",
      "end": "2024 vecka 02"
    },
    {
      "name": "Examensarbete i omvårdnad med inriktning mot vård av äldre",
      "city": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=OM2535&revision=4&lang=sv",
      "form": "Distans",
      "speed": 50,
      "location": "Distans",
      "code": "OM2535",
      "points": 15.0,
      "languages": [
        "Svenska"
      ],
      "teachers": [],
      "description": "Syftet med kursen är att studenten fördjupar kunskapen om forskningsdesign, forskningsmetod, forskningsetik samt sin förmåga att tillämpa forskningsprocessens steg i ett examensarbete i omvårdnad med inriktning mot vård av äldre. Syftet är också att studenten vidareutvecklar förmågan att kritiskt granska, bedöma och diskutera eget samt andras examensarbete.",
      "requirements": "För tillträde till kursen krävs avklarad kurs Specialistsjuksköterskans profession och vetenskapliga förhållningssätt inom vård av äldre, 30 hp.",
      "start": "2024 vecka 03",
      "end": "2024 vecka 22"
    }
  ],
  "optional_courses": [],
  "start": "2022 vecka 35",
  "end": "2023 vecka 02",
  "generated": "2023-01-08 22:05:32.339417"
}