{
  "name": "Masterprogram i Software Engineering",
  "points": 120.0,
  "start": "2023 vecka 35",
  "end": "2025 vecka 23",
  "requirements": "Kandidatexamen eller högskoleingenjörsexamen motsvarande minst 180 hp inom något av områdena Programvaruteknik, Datavetenskap eller Datalogi. Examen ska omfatta minst 90 hp Programvaruteknik, Datavetenskap eller Datalogi varav minst 30 hp ska utgöras av kurser inom Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem. Dessutom krävs 7,5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp. Examen ska även omfatta 15 hp i Matematik. Engelska 6.",
  "courses": [
    {
      "name": "Agile och Lean Mjukvaruutveckling",
      "points": 7.5,
      "start": "2023 vecka 35",
      "end": "2023 vecka 43",
      "requirements": "Avklarade kurser omfattande minst 120 hp varav minst 90 hp inom följande områden: Programvaruteknik, Datavetenskap, Informationssystem eller Datalogi. Dessutom krävs avklarad kurs på minst 7.5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp.",
      "code": "PA2555",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BJ6KN",
      "optional": true
    },
    {
      "name": "Seminarier i Programvaruteknik",
      "points": 7.5,
      "start": "2023 vecka 35",
      "end": "2023 vecka 43",
      "requirements": "Avklarade kurser omfattande minst 120 hp varav minst 90 hp vara inom följande områden: Programvaruteknik, Datavetenskap, eller Datalogi. Minst 30 hp ska vara  inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem. Dessutom krävs en avklarad kurs på minst 7.5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp.",
      "code": "PA2550",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BPC6L",
      "optional": false
    },
    {
      "name": "Kravhantering och produkthantering",
      "points": 7.5,
      "start": "2023 vecka 44",
      "end": "2024 vecka 02",
      "requirements": "För tillträde till kursen krävs avklarade kurser omfattande minst 120 hp varav minst 90 hp ska vara inom följande områden: programvaruteknik, datavetenskap, informationssystem, datalogi, maskinteknik eller industriell ekonomi. Dessutom krävs en genomgången kurs på minst 7,5 hp inom grundläggande Programvaruteknik eller Systemteknik alternativt en genomgången projektkurs i grupp på minst 7,5 hp i Programvaruteknik eller Systemteknik.",
      "code": "PA2591",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BJ37L",
      "optional": false
    },
    {
      "name": "Programvaruarkitektur och kvalitet",
      "points": 7.5,
      "start": "2023 vecka 44",
      "end": "2024 vecka 02",
      "requirements": "Studenten måste ha klarat av totalt 22,5 högskolepoäng från följande områden: Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem samt avklarat en kurs i Programmering på minst 6 högskolepoäng.",
      "code": "PA1453",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BAC3F",
      "optional": true
    },
    {
      "name": "Forskningsmetodik i Programvaruteknik och Datavetenskap",
      "points": 7.5,
      "start": "2024 vecka 03",
      "end": "2024 vecka 12",
      "requirements": "Avklarade kurser omfattande minst 120 hp varav minst 90 hp vara inom följande områden: Programvaruteknik, Datavetenskap, eller Datalogi. Minst 30 hp ska vara  inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem. Dessutom krävs  15 hp avklarade kurser inom Matematik.",
      "code": "PA2554",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/B3J7N",
      "optional": false
    },
    {
      "name": "Mjukvarutestning",
      "points": 7.5,
      "start": "2024 vecka 03",
      "end": "2024 vecka 12",
      "requirements": "Avklarade kurser omfattande minst 120 hp varav minst 90 hp vara inom följande områden: Programvaruteknik, Datavetenskap, eller Datalogi. Minst 30 hp ska vara  inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem. Dessutom krävs avklarad kurs på minst 7.5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp.",
      "code": "PA2552",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BDNH9",
      "optional": true
    },
    {
      "name": "Beslutsstödjande system",
      "points": 7.5,
      "start": "2024 vecka 13",
      "end": "2024 vecka 22",
      "requirements": "För tillträde till kursen krävs avklarade kurser i programmering 15 hp, databaser, 7,5 hp.",
      "code": "DV2573",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BFTPQ",
      "optional": true
    },
    {
      "name": "Matematisk statistik",
      "points": 7.5,
      "start": "2024 vecka 13",
      "end": "2024 vecka 22",
      "requirements": "15 hp matematik avklarat.",
      "code": "MS1411",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BPKPK",
      "optional": true
    },
    {
      "name": "Mätningar av programvara",
      "points": 7.5,
      "start": "2024 vecka 13",
      "end": "2024 vecka 22",
      "requirements": "Avklarade kurser omfattande minst 120 hp inkluderande avslutade kurser i Programmering, Datastrukturer och Algoritmer, och Mjukvaruutveckling (Software Engineering) eller Programvaruutvecklingsprojekt i grupp. Samt 15 hp avklarade kurser inom Matematik.",
      "code": "PA2559",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/B7Y4F",
      "optional": false
    },
    {
      "name": "Social hållbarhet i produkt- och tjänsteutveckling",
      "points": 7.5,
      "start": "2024 vecka 13",
      "end": "2024 vecka 22",
      "requirements": "För tillträde till kursen krävs 120 hp högskolestudier avklarade samt Engelska 6.",
      "code": "SL2554",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BP4DM",
      "optional": true
    },
    {
      "name": "Evolution och Underhåll av Mjukvara - Projekt",
      "points": 7.5,
      "start": "2024 vecka 36",
      "end": "2024 vecka 44",
      "requirements": "Avklarade kurser omfattande minst 120 hp varav minst 30 hp ska vara  inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem. Dessutom krävs avklarad kurs på minst 7.5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp.",
      "code": "PA2558",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/B4HP9",
      "optional": false
    },
    {
      "name": "Prestandaoptimering",
      "points": 7.5,
      "start": "2024 vecka 36",
      "end": "2024 vecka 44",
      "requirements": "För tillträde till kursen krävs att den studerande har avklarat: programmering 15 hp, algoritmer och datastrukturer 6 hp, datakommunikation 4 hp och realtids- och operativsystem 6 hp.",
      "code": "DV1567",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BU3QK",
      "optional": true
    },
    {
      "name": "Programmering i UNIX-miljö",
      "points": 7.5,
      "start": "2024 vecka 36",
      "end": "2024 vecka 44",
      "requirements": "För tillträde till kursen krävs att den studerande har avklarat kurser i programmering, 15 hp, algoritmer och datastrukturer, 6 hp, operativsystem, 6hp och datakommunikation alt lokala nätverk, 4 hp.",
      "code": "DV1457",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BML3F",
      "optional": true
    },
    {
      "name": "Tillämpad artificiell intelligens",
      "points": 7.5,
      "start": "2024 vecka 36",
      "end": "2024 vecka 44",
      "requirements": "För tillträde till kursen krävs 12 avklarade hp från moment i programmeringskurser (Python eller dylikt) samt 6 avklarade hp i datastrukturer och algoritmer.",
      "code": "DV2618",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BADLG",
      "optional": true
    },
    {
      "name": "Fördjupningskurs i Programvaruteknik",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "Avklarade kurser omfattande minst 120 hp varav minst 90 hp inom följande områden: Programvaruteknik, Datavetenskap eller Datalogi. Dessutom krävs avklarade kurser på minst 30 hp på avancerad nivå,  en avklarad kurs på minst 7,5 inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp samt genomgått kurs i Forskningsmetodik på minst 7,5 hp.",
      "code": "PA2560",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/B99YW",
      "optional": true
    },
    {
      "name": "Kvalitetsstyrning",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "Avklarade kurser omfattande minst 120 hp varav minst 90 hp inom följande områden: Programvaruteknik, Datavetenskap eller Datalogi. Dessutom krävs en avklarad kurs på minst 7.5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp.",
      "code": "PA2557",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BJF37",
      "optional": true
    },
    {
      "name": "Maskininlärning",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs en avklarad kurs inom Tillämpad artificiell intelligens omfattande minst 6 hp.",
      "code": "DV2626",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/B7UDJ",
      "optional": true
    },
    {
      "name": "Multiprocessorprogrammering",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs 60 hp avklarade i huvudområdet datavetenskap eller huvudområdet programvaruteknik inklusive avklarade kurser i programmering 12 hp, algoritmer och datastrukturer, 6 hp, operativsystem, 6 hp och datorteknik, 6 hp.",
      "code": "DV2597",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BJUHX",
      "optional": true
    },
    {
      "name": "Programvarusäkerhet",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs 90 hp varav 40 hp inom det tekniska området varav en avklarad kurs på minst 6 hp inom programmering i C, C++ eller minst 120 hp varav minst 90 hp inom det tekniska området och minst 2 års yrkeserfarenhet inom område som är relaterat till mjukvaruintensiv produkt och/eller tjänsteutveckling (visas exempelvis genom intyg från arbetsgivare).",
      "code": "DV2620",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BCRQJ",
      "optional": true
    },
    {
      "name": "Tillämpad Cloud Computing och Big Data",
      "points": 7.5,
      "start": "2024 vecka 45",
      "end": "2025 vecka 03",
      "requirements": "Minst 90hp inom ett tekniskt område varav minst 30 hp skall utgöras av kurser inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem.eller Minst 90 hp inom området teknologi och minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "code": "PA2577",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20242/BLJ49",
      "optional": true
    },
    {
      "name": "Masterarbete i Programvaruteknik",
      "points": 30.0,
      "start": "2025 vecka 04",
      "end": "2025 vecka 23",
      "requirements": "För tillträde till kursen krävs minst 90 högskolepoäng inom huvudområdet programvaruteknik, varav minst 30 högskolepoäng på avancerad nivå. Dessutom krävs att den studerande har avklarat en kurs i forskningsmetodik i programvaruteknik och/eller datavetenskap om 7.5 högskolepoäng.",
      "code": "PA2534",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20251/B6CXQ",
      "optional": false
    }
  ],
  "href": "https://www.bth.se/utbildning/program-och-kurser/paasw/",
  "updated": 1666447212940
}