{
  "name": "Magisterprogram i Software Engineering",
  "points": 60.0,
  "start": "2023 vecka 03",
  "end": "2025 vecka 03",
  "requirements": "Kandidatexamen eller högskoleingenjörsexamen om minst 180 hp inom ett tekniskt område, examen ska omfatta ett självständigt arbete om minst 15 högskolepoäng. Minst två års yrkeserfarenhet av mjukvarurelaterad utveckling efter examen (visas genom intyg från arbetsgivare). Yrkeserfarenheten förväntas omfatta kunskaper i programmering (visas genom intyg från arbetsgivare). Engelska 6.",
  "courses": [
    {
      "name": "Adaptiv Lean Programvarutestning",
      "points": 7.5,
      "start": "2023 vecka 03",
      "end": "2023 vecka 22",
      "requirements": "Minst 90 hp inom ett tekniskt område varav en avklarad kurs på 7,5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp, och varav minst 30 hp skall utgöras av kurser inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem. eller Minst 90 hp inom området teknologi och minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "code": "PA2579",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20231/BECD9",
      "optional": false
    },
    {
      "name": "Produkthantering och kravhantering för digitala miljöer",
      "points": 7.5,
      "start": "2023 vecka 03",
      "end": "2023 vecka 22",
      "requirements": "Minst 90 hp varav minst 60 hp inom  ett tekniskt område.",
      "code": "PA2578",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20231/B6YEK",
      "optional": false
    },
    {
      "name": "Agil och Lean utveckling av mjukvaruintensiva produkter",
      "points": 7.5,
      "start": "2023 vecka 34",
      "end": "2024 vecka 02",
      "requirements": "Minst 90 hp inom ett tekniskt område varav en avklarad kurs på 7,5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp, och varav minst 30 hp skall utgöras av kurser inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem.eller Minst 90 hp inom området teknologi och minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "code": "PA2580",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BCN9M",
      "optional": false
    },
    {
      "name": "Tillämpad Cloud Computing och Big Data",
      "points": 7.5,
      "start": "2023 vecka 34",
      "end": "2024 vecka 02",
      "requirements": "Minst 90hp inom ett tekniskt område varav minst 30 hp skall utgöras av kurser inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem.eller Minst 90 hp inom området teknologi och minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "code": "PA2577",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/B6D7G",
      "optional": true
    },
    {
      "name": "Forskningsmetodik och magisterarbete i programvaruteknik för yrkesverksamma",
      "points": 18.0,
      "start": "2024 vecka 03",
      "end": "2025 vecka 03",
      "requirements": "För tillträde till kursen krävs minst 120 hp inom området teknologi och 7,5 hp i en avancerad (A1N) kurs inom området mjukvaruteknik samt minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "code": "PA2592",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BFPC9",
      "optional": false
    },
    {
      "name": "Introduktion till säkerhet för mjukvaruutveckling",
      "points": 6.0,
      "start": "2024 vecka 03",
      "end": "2024 vecka 22",
      "requirements": "För tillträde till kursen krävs att minst 120 hp är avklarade varav 90 hp inom ett tekniskt område samt minst 2 års yrkeserfarenhet inom område som är relaterat till mjukvaruintensiv produkt och/eller tjänsteutveckling (visas exempelvis genom intyg från arbetsgivare.)",
      "code": "PA2585",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BLJAG",
      "optional": false
    },
    {
      "name": "Maskininlärning och säkerhet",
      "points": 6.0,
      "start": "2024 vecka 03",
      "end": "2024 vecka 12",
      "requirements": "För tillträde till kursen krävs minst 120 hp varav 90 hp inom ett tekniskt område och minst 2 års yrkeserfarenhet inom område som är relaterat till mjukvaruintensiv produkt och/eller tjänsteutveckling (visas exempelvis genom intyg från arbetsgivare.)",
      "code": "DV2612",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BENLH",
      "optional": false
    }
  ],
  "href": "https://www.bth.se/utbildning/program-och-kurser/paasa/",
  "updated": 1666476243560
}