{
  "name": "Magisterprogram i strategiskt ledarskap för hållbarhet",
  "points": 60.0,
  "start": "2023 vecka 35",
  "end": "2024 vecka 22",
  "requirements": "Kandidatexamen eller yrkesexamen om 180 högskolepoäng eller motsvarande, Engelska 6, samt minst sex månaders relevant yrkeslivserfarenhet, såsom arbete, praktikarbete, volontärarbete, förtroendeuppdrag, eller motsvarande, på heltid eller deltid, som visar på erfarenhet av hållbarhetsarbete.",
  "courses": [
    {
      "name": "Ledarskap i komplexitet",
      "points": 10.0,
      "start": "2023 vecka 35",
      "end": "2024 vecka 22",
      "requirements": "Kandidatexamen eller yrkesexamen om 180 högskolepoäng och Engelska B samt minst sex månaders relevant yrkeslivserfarenhet, såsom arbete, praktikarbete, volontärarbete, förtroendeuppdrag, eller motsvarande, på heltid eller deltid, som visar på erfarenhet av hållbarhetsarbete.",
      "code": "SL2534",
      "description": "Syftet med kursen är att studenten ska (1) utveckla fördjupad kunskap om och förståelse för teoretiska grunder för ledarskap i komplexitet, särskilt i relation till transformativ förändring för hållbarhet och (2) utveckla färdighet som krävs för att arbeta effektivt med komplexa utmaningar, inklusive förmåga att kritiskt reflektera över olika arbetssätt inom området.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/B4TXM",
      "optional": false
    },
    {
      "name": "Strategisk hållbar utveckling",
      "points": 12.5,
      "start": "2023 vecka 35",
      "end": "2023 vecka 43",
      "requirements": "Kandidatexamen eller yrkesexamen om 180 hp samt Engelska B.",
      "code": "SL2533",
      "description": "Syftet med kursen är att studenten ska (1) utveckla fördjupad kunskap om och förståelse för samhällets hållbarhetsutmaningar och grundläggande orsaker till dessa, (2) utveckla fördjupad kunskap om och förståelse för en strukturerande och koordinerande metodik för strategisk hållbar utveckling, inklusive dess vetenskapliga grunder, samt (3) utveckla färdighet i att tillämpa metodiken och i att kritiskt reflektera över den i förhållande till vanligen citerade begrepp, metoder och verktyg av relevans för strategisk hållbar utveckling.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/B4JMH",
      "optional": false
    },
    {
      "name": "Forskningsmetodik för hållbarhet",
      "points": 5.0,
      "start": "2023 vecka 44",
      "end": "2024 vecka 17",
      "requirements": "För tillträde till kursen krävs avklarade kurs Strategisk hållbar utveckling 12,5 hp samt att 2,5 hp av kursen Ledarskap i komplexitet (10 hp) är avklarade.",
      "code": "SL2537",
      "description": "Syftet med kursen är att studenten ska (1) utveckla fördjupad kunskap om och förståelse för olika forskningsmetoder och angreppssätt, särskilt inom hållbarhetsforskning, (2) utveckla kompetens och färdighet för att kritiskt bedöma och använda lämpliga metoder och angreppssätt, samt (3) förbereda för sitt examensarbete inom strategiskt ledarskap för hållbarhet.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BY3GN",
      "optional": false
    },
    {
      "name": "Innovation för hållbarhet",
      "points": 5.0,
      "start": "2023 vecka 44",
      "end": "2023 vecka 48",
      "requirements": "För tillträde till kursen krävs att 5 hp av kursen Strategisk hållbar utveckling (12,5 hp) är avklarade.",
      "code": "SL2540",
      "description": "Syftet med kursen är att studenten ska (1) utveckla fördjupad kunskap om och förståelse för hur innovation kan stödja samhällets omställning till hållbarhet, och (2) utveckla praktisk färdighet inom detta område, till exempel hur man kritiskt bedömer befintliga produkter och processer samt hur man tillämpar kreativitetsmetoder och kreativitetsverktyg för innovation för hållbarhet.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BNPUR",
      "optional": false
    },
    {
      "name": "Strategisk planering för hållbarhet",
      "points": 7.5,
      "start": "2023 vecka 44",
      "end": "2024 vecka 07",
      "requirements": "För tillträde till kursen krävs att kursen Strategisk hållbar utveckling 12,5 hp är avklarad, samt att 2,5 hp av kursen Ledarskap i komplexitet, 10 hp är avklarade.",
      "code": "SL2550",
      "description": "Syftet med kursen är att studenten ska (1) utveckla fördjupad kunskap om och förståelse för strategiskt tänkande och planering för hållbarhet, (2) utveckla fördjupad kunskap om och praktisk förståelse för hur en metodik för strategisk hållbar utveckling kan användas för att strukturera och koordinera detta arbete, samt (3) utveckla ledaregenskaper genom lagarbete.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20232/BHATJ",
      "optional": false
    },
    {
      "name": "Magisterarbete i strategiskt ledarskap för hållbarhet",
      "points": 20.0,
      "start": "2024 vecka 03",
      "end": "2024 vecka 22",
      "requirements": "För tillträde till kursen krävs avklarade kurser Strategisk hållbar utveckling 12,5 hp och Innovation för hållbarhet, 5 hp samt att 2,5 hp av kursen Ledarskap i komplexitet (10 hp) är avklarade.",
      "code": "SL2538",
      "description": "Syftet med kursen är att studenten ska (1) utveckla fördjupad kunskap om ett specifikt forskningsämne av relevans för strategiskt ledarskap för hållbarhet, (2) utveckla fördjupad kunskap om och färdighet i att tillämpa forskningsmetodik, samt (3) utveckla ledaregenskaper genom lagarbete.",
      "href": "http://www.bth.se/utbildning/program-och-kurser/kurser/20241/BUJEM",
      "optional": false
    }
  ],
  "href": "https://www.bth.se/utbildning/program-och-kurser/slash/",
  "updated": 1666647667277
}