{
  "name": "Specialistsjuksköterskeprogram med inriktning mot distriktssköterska",
  "points": 75.0,
  "start": "2023 vecka 35",
  "end": "2024 vecka 44",
  "requirements": "Sjuksköterskeexamen och kandidatexamen i omvårdnad/vårdvetenskap. Svensk legitimation som sjuksköterska. Yrkeserfarenhet som sjuksköterska motsvarande 6 månaders heltidstjänstgöring.",
  "courses": [
    {
      "name": "Specialistsjuksköterskans profession och vetenskapliga förhållningssätt inom distriktssköterskans verksamhetsområde",
      "points": 30.0,
      "start": "2023 vecka 35",
      "end": "2024 vecka 02",
      "requirements": "För tillträde till kursen krävs sjuksköterskeexamen och kandidatexamen. Svensk legitimation som sjuksköterska. Yrkeserfarenhet som sjuksköterska motsvarande 6 månaders heltidstjänstgöring.",
      "code": "OM2543"
    },
    {
      "name": "Farmakologi och förskrivningsrätt för vissa läkemedel, hjälpmedel och förbrukningsartiklar inom distriktssköterskans verksamhetsområde",
      "points": 15.0,
      "start": "2024 vecka 03",
      "end": "2024 vecka 12",
      "requirements": "För tillträde till kursen krävs sjuksköterskeexamen och kandidatexamen i omvårdnad/vårdvetenskap. Svensk legitimation som sjuksköterska. Yrkeserfarenhet som sjuksköterska motsvarande 6 månaders heltidstjänstgöring.",
      "code": "OM2544"
    },
    {
      "name": "Hälsofrämjande omvårdnad ur ett livsloppsperspektiv",
      "points": 15.0,
      "start": "2024 vecka 13",
      "end": "2024 vecka 22",
      "requirements": "Sjuksköterskeexamen och kandidatexamen i omvårdnad/vårdvetenskap. Svensk legitimation som sjuksköterska. Yrkeserfarenhet som sjuksköterska motsvarande 6 månaders heltidstjänstgöring. Därutöver krävs minst 15 hp på nivå A1N inom omvårdnad.",
      "code": "OM2545"
    },
    {
      "name": "Examensarbete i omvårdnad med inriktning mot distriktsköterskans verksamhetsområde",
      "points": 15.0,
      "start": "2024 vecka 36",
      "end": "2024 vecka 45",
      "requirements": "För tillträde till kursen krävs avklarad kurs Specialistsjuksköterskans profession och vetenskapliga förhållningssätt inom distriktssköterskans verksamhetsområde, 30 hp.",
      "code": "OM2531"
    }
  ],
  "updated": 1666433859744
}