{
  "code": "PAASA22v",
  "name": "Magisterprogram i Software Engineering ",
  "location": "DistansHela eller delar av undervisningen bedrivs på distans.",
  "place": "Distans",
  "speed": 50,
  "time_of_day": "Kväll",
  "points": 60.0,
  "teacher": "Deepika Badampudi",
  "url": "utb_kurstillfalle.asp?KtTermin=20231&KtAnmKod=BUQEF&lang=sv&parentPtKod=PAASA22v",
  "program_plan": "https://edu.bth.se/utbildningsplaner/PAASA_vt-22.pdf",
  "start": "202203",
  "end": "202352",
  "generated": "2023-10-30 09:53:16.409223",
  "courses": [
    {
      "name": "Produkthantering och kravhantering för digitala miljöer",
      "code": "PA2578",
      "description": "Syftet med kursen är att erbjuda en gedigen och substantiell träning i kontinuerlig kravhantering och produkthantering för digitala miljöer. Det inkluderar en förståelse för hur digitalisering påverkar företagens verksamhet och vilka produkter som kan komma att digitaliseras eller ersättas. Kursen går igenom olika affärsmodeller som digitaliseringen introducerar i industrin och presenterar hur företag drar ekonomisk och organisatorisk nytta av digitala produkter och tjänster.  Kursen förbereder studenter i att praktiskt hantera problem som uppstår vid hantering av krav i en förändringsbenägen och kostnadskänslig verklighet.  Kursen diskuterar utmaningar i relation till storskalig kravhantering och marknadsdriven kravhantering. Områden som diskuteras och kopplas till industripraxis inkluderar kontinuerlig kravhantering, kravhanteringsprocessförbättringar, och teknisk produkthantering.",
      "requirements": "Minst 90 hp varav minst 60 hp inomett tekniskt område.",
      "is_optional": true,
      "has_requirements": false,
      "place": "Distans",
      "time_of_day": "Kväll",
      "speed": 50,
      "course_page": "https://edu.bth.se/utbildning/utb_kurstillfalle.asp?KtTermin=20221&KtAnmKod=B6CF4&lang=sv&parentPtKod=PAASA22v",
      "start": "202203",
      "end": "202222",
      "semester": 3,
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=PA2578&revision=3&lang=sv",
      "location": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "languages": [
        "engelska"
      ],
      "points": 7.5,
      "teachers": [
        "Krzysztof Wnuk"
      ]
    },
    {
      "name": "Adaptiv Lean Programvarutestning",
      "code": "PA2579",
      "description": "Syftet med kursen är att ge grundläggande förståelse om tekniker och verktyg för verifiering och validering av mjukvara i miljöer där principer för adaptiv, agil eller lean mjukvaruutveckling tillämpas. Målet är att förse studenten med branschrelevant kunskap av verifiering och validering som en testingenjör skall ha kunskap om i en modern utvecklingsmiljö för att främja utveckling av mjukvara av hög kvalitet till nytta för IT-utvecklingen inom både industri och samhället i stort.",
      "requirements": "Minst 90 hp inom ett tekniskt område varav en avklarad kurs på 7,5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp, och varav minst 30 hp skall utgöras av kurser inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem.    eller    Minst 90 hp inom området teknologi och minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "is_optional": true,
      "has_requirements": true,
      "place": "Distans",
      "time_of_day": "Kväll",
      "speed": 50,
      "course_page": "https://edu.bth.se/utbildning/utb_kurstillfalle.asp?KtTermin=20221&KtAnmKod=BGHEH&lang=sv&parentPtKod=PAASA22v",
      "start": "202203",
      "end": "202222",
      "semester": 3,
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=PA2579&revision=3&lang=sv",
      "location": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "languages": [
        "engelska"
      ],
      "points": 7.5,
      "teachers": [
        "Emil Alégroth",
        "Michel Nass"
      ]
    },
    {
      "name": "Tillämpad Cloud Computing och Big Data",
      "code": "PA2577",
      "description": "I dagens mobila uppkopplade värld genereras stora mängder data som behöver hanteras, analyseras, och länkas samman. Detta görs på en stor mängd servrar på det så kallade Molnet. Utvecklingen, driftsättningen, och hanteringen av dessa kallas Cloud Computing. Syftet med den här kursen är att ge en bred bakgrund om att designa, utveckla, driftsätta, testa och övervaka en cloud-lösning, specifikt med fokus på stora datamängder. Kursen ger en översikt över populära cloud-plattformar samt design och driftsättning av cloud-applikationer. Vidare introducerar kursen MapReduce, nosql-databaser, och verktyg för storskalig distribuerad dataanalys såsom Hadoop, och hur dessa kan driftsättas i en cloud applikation.",
      "requirements": "Minst 90hp inom ett tekniskt område varav minst 30 hp skall utgöras av kurser inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem.   eller    Minst 90 hp inom området teknologi och minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "is_optional": true,
      "has_requirements": false,
      "place": "Distans",
      "time_of_day": "Kväll",
      "speed": 50,
      "course_page": "https://edu.bth.se/utbildning/utb_kurstillfalle.asp?KtTermin=20222&KtAnmKod=B3NMJ&lang=sv&parentPtKod=PAASA22v",
      "start": "202235",
      "end": "202302",
      "semester": 1,
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=PA2577&revision=2&lang=sv",
      "location": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "languages": [
        "engelska"
      ],
      "points": 7.5,
      "teachers": [
        "Mikael Svahnberg"
      ]
    },
    {
      "name": "Agil och Lean utveckling av mjukvaruintensiva produkter",
      "code": "PA2580",
      "description": "Syftet med kursen är att ge en förståelse för tillämpning av mjukvaruutveckling i en miljö som bygger på filosofin Lean och agilt arbetssätt. Det inkluderar en förståelse för branschrelevanta tekniker för att främja utvecklingen av mjukvaruprodukter samt förståelse för att värdet är av största vikt inom verksamheter och organisationer. Fokus i kursen ligger därmed på att skapa en ökad förståelse för relationen mellan värden och principers påverkan för verksamheter och organisationer för att uppnå bästa tillämpning av agilt arbetssätt och Lean som filosofi.",
      "requirements": "Minst 90 hp inom ett tekniskt område varav en avklarad kurs på 7,5 hp inom Grundläggande Programvaruteknik (Software Engineering) eller Programvaruutvecklingsprojekt i grupp, och varav minst 30 hp skall utgöras av kurser inom ett eller flera av följande områden: Programmering, Objektorienterad systemutveckling, Programvarudesign, Datastrukturer och algoritmer, Databasteknik, Datakommunikation, Realtidssystem, Operativsystem.   eller    Minst 90 hp inom området teknologi och minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "is_optional": true,
      "has_requirements": true,
      "place": "Distans",
      "time_of_day": "Kväll",
      "speed": 50,
      "course_page": "https://edu.bth.se/utbildning/utb_kurstillfalle.asp?KtTermin=20222&KtAnmKod=BJUGN&lang=sv&parentPtKod=PAASA22v",
      "start": "202235",
      "end": "202302",
      "semester": 1,
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=PA2580&revision=2&lang=sv",
      "location": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "languages": [
        "engelska"
      ],
      "points": 7.5,
      "teachers": [
        "hed"
      ]
    },
    {
      "name": "Introduktion till säkerhet för mjukvaruutveckling",
      "code": "PA2585",
      "description": "Syftet med kursen är att introducera säkerhet och säkerhetsprinciper/metoder relevanta för mjukvaruutveckling samt dess olika delar/faser såsom kravhantering, design, implementering, verifikation, validering samt underhåll.   Denna kurs syftar till att ge en guide och introduktion till säkerhetsaspekter under hela mjukvaruutvecklingsprocessen. Vi tittar på säkerhetsaspekter från de tidigaste delarna av planering till release och vidare (underhåll och uppdatering). Kursen ger en bra introduktion till icke-säkerhetsexperter primärt och går igenom hur utvecklare/chefer/beslutsfattare kan använda sig av \u0094säkerhet\u0094 för att förbättra (mjukvarubaserade) produkter och tjänster, samt hur de påverkas av säkerhetsutmaningar och problem.    Vare sig du är en mjukvaruutvecklare i en bank eller ett telekomföretag, eller produktledare i ett spelföretag är denna kurs relevant för dig.",
      "requirements": "För tillträde till kursen krävs att minst 120 hp är avklarade varav 90 hp inom ett tekniskt område samt minst 2 års yrkeserfarenhet inom område som är relaterat till mjukvaruintensiv produkt och/eller tjänsteutveckling (visas exempelvis genom intyg från arbetsgivare.)",
      "is_optional": true,
      "has_requirements": true,
      "place": "Distans",
      "time_of_day": "Kväll",
      "speed": 50,
      "course_page": "https://edu.bth.se/utbildning/utb_kurstillfalle.asp?KtTermin=20231&KtAnmKod=BUQEF&lang=sv&parentPtKod=PAASA22v",
      "start": "202303",
      "end": "202322",
      "semester": 3,
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=PA2585&revision=1&lang=sv",
      "location": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "languages": [
        "engelska"
      ],
      "points": 6.0,
      "teachers": [
        "OleksandrAdamov"
      ]
    },
    {
      "name": "Maskininlärning och säkerhet",
      "code": "DV2612",
      "description": "Syftet med kursen är att studenterna ska lära sig aktuella tillvägagångssätt, metoder och verktyg för maskininlärning (ML) för säkerhet. Kursen kommer även fokusera på olika säkerhetsproblem relaterade till ML processen.",
      "requirements": "För tillträde till kursen krävs minst 120 hp varav 90 hp inom ett tekniskt område och minst 2 års yrkeserfarenhet inom område som är relaterat till mjukvaruintensiv produkt och/eller tjänsteutveckling (visas exempelvis genom intyg från arbetsgivare.)",
      "is_optional": true,
      "has_requirements": false,
      "place": "Distans",
      "time_of_day": "Kväll",
      "speed": 50,
      "course_page": "https://edu.bth.se/utbildning/utb_kurstillfalle.asp?KtTermin=20231&KtAnmKod=BU494&lang=sv&parentPtKod=PAASA22v",
      "start": "202303",
      "end": "202322",
      "semester": 3,
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=DV2612&revision=1&lang=sv",
      "location": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "languages": [
        "engelska"
      ],
      "points": 6.0,
      "teachers": [
        "VolodymyrTkach",
        "vvk"
      ]
    },
    {
      "name": "Forskningsmetodik och magisterarbete i programvaruteknik för yrkesverksamma",
      "code": "PA2592",
      "description": "Syftet med kursen är att studenten ska träna sin förmåga att definiera, planera, genomföra och redovisa ett självständigt vetenskapligt forskningsarbete. Studenten förväntas tillämpa de under utbildningen förvärvade kunskaperna för att självständigt fördjupa sig inom ett eller flera specifika delområden inom huvudområdet programvaruteknik. Målet för studenten är att muntligen och skriftligen redovisa resultatet av forskningsarbetet samt att kritiskt granska och opponera på ett annat examensarbete.",
      "requirements": "För tillträde till kursen krävs minst 120 hp inom området teknologi och 7,5 hp i en avancerad (A1N) kurs inom området mjukvaruteknik samt minst 2 års yrkeserfarenhet av mjukvarurelaterad utveckling (visas exempelvis genom intyg från arbetsgivare).",
      "is_optional": true,
      "has_requirements": false,
      "place": "Distans",
      "time_of_day": "Kväll",
      "speed": 50,
      "course_page": "https://edu.bth.se/utbildning/utb_kurstillfalle.asp?KtTermin=20231&KtAnmKod=BM9AK&lang=sv&parentPtKod=PAASA22v",
      "start": "202303",
      "end": "202322",
      "semester": 3,
      "study_plan": "https://bth.azure-api.net/plan/api/kursplan?kurskod=PA2592&revision=1&lang=sv",
      "location": "DistansStörre delen av undervisningen bedrivs på distans, se vidare under rubriken Anmärkning.",
      "languages": [
        "engelska"
      ],
      "points": 18.0,
      "teachers": [
        "Nauman Ali"
      ]
    }
  ]
}